In [134]:
# PANDAS

In [135]:
#numpy and pandas import
import numpy as np
import pandas as pd

In [136]:
# create new array(array between the 1 and 10000, array length is 21)
arr = np.random.randint(1,10000,21)
arr

array([3884,  393, 2684, 4191, 6534, 2436, 3389, 8620, 1142, 8461, 8821,
       4325, 4747,  404,  524, 5284,  375, 4282, 3065,  345, 2743])

In [137]:
# converting to the 2 dimensional array
arr.reshape(3,7)

array([[3884,  393, 2684, 4191, 6534, 2436, 3389],
       [8620, 1142, 8461, 8821, 4325, 4747,  404],
       [ 524, 5284,  375, 4282, 3065,  345, 2743]])

In [138]:
df = pd.DataFrame(arr.reshape(3,7) , index=["ALi","Veli","Melih"], columns=["First","Second","Third","Fourth","Fifth","Sixth","Seventh"])
df

       First  Second  Third  Fourth  Fifth  Sixth  Seventh
ALi     3884     393   2684    4191   6534   2436     3389
Veli    8620    1142   8461    8821   4325   4747      404
Melih    524    5284    375    4282   3065    345     2743

In [139]:
#get the "First" column
df["First"]

ALi      3884
Veli     8620
Melih     524
Name: First, dtype: int32

In [140]:
df[["First","Third"]]

       First  Third
ALi     3884   2684
Veli    8620   8461
Melih    524    375

In [141]:
## loc function use to be for get the row
df.loc["Veli"]

First      8620
Second     1142
Third      8461
Fourth     8821
Fifth      4325
Sixth      4747
Seventh     404
Name: Veli, dtype: int32

In [142]:
## iloc function is used to get by index number
df.iloc[2]

First       524
Second     5284
Third       375
Fourth     4282
Fifth      3065
Sixth       345
Seventh    2743
Name: Melih, dtype: int32

In [143]:
## add new column
df["New"] = df["First"] + df["Fifth"]
df

       First  Second  Third  Fourth  Fifth  Sixth  Seventh    New
ALi     3884     393   2684    4191   6534   2436     3389  10418
Veli    8620    1142   8461    8821   4325   4747      404  12945
Melih    524    5284    375    4282   3065    345     2743   3589

In [144]:
## Delete row or column
## (optional) for delete the row -> axis = 0
## for delete the column -> axis = 1
df = df.drop("Melih")
df

      First  Second  Third  Fourth  Fifth  Sixth  Seventh    New
ALi    3884     393   2684    4191   6534   2436     3389  10418
Veli   8620    1142   8461    8821   4325   4747      404  12945

In [145]:
df = df.drop(["Sixth","New"],axis=1)
df

      First  Second  Third  Fourth  Fifth  Seventh
ALi    3884     393   2684    4191   6534     3389
Veli   8620    1142   8461    8821   4325      404

In [146]:
## inplace function
df["Zero"] = 0 ## add column
df.drop("Zero",axis=1, inplace=True)## and delete the row
df

      First  Second  Third  Fourth  Fifth  Seventh
ALi    3884     393   2684    4191   6534     3389
Veli   8620    1142   8461    8821   4325      404

In [147]:
## using 1
df.loc["Veli","Second"]

1142

In [148]:
## using 2
df.loc["Veli","Second"]

1142

In [149]:
## true/false
boolDf = df < 5000
boolDf

      First  Second  Third  Fourth  Fifth  Seventh
ALi    True    True   True    True  False     True
Veli  False    True  False   False   True     True

In [150]:
df

      First  Second  Third  Fourth  Fifth  Seventh
ALi    3884     393   2684    4191   6534     3389
Veli   8620    1142   8461    8821   4325      404

In [151]:
## Important example
df[boolDf]

       First  Second   Third  Fourth   Fifth  Seventh
ALi   3884.0     393  2684.0  4191.0     NaN     3389
Veli     NaN    1142     NaN     NaN  4325.0      404

In [152]:
## reset_index() function
df.reset_index()

  index  First  Second  Third  Fourth  Fifth  Seventh
0   ALi   3884     393   2684    4191   6534     3389
1  Veli   8620    1142   8461    8821   4325      404

In [155]:
indexList = ["A", "V"]

In [156]:
df["New Index"] = indexList
df

      First  Second  Third  Fourth  Fifth  Seventh New Index
ALi    3884     393   2684    4191   6534     3389         A
Veli   8620    1142   8461    8821   4325      404         V

In [157]:
## set_index
df.set_index("New Index")

           First  Second  Third  Fourth  Fifth  Seventh
New Index
A           3884     393   2684    4191   6534     3389
V           8620    1142   8461    8821   4325      404

In [158]:
## long way
mainIndex = ["Simpson", "Simpson", "Simpson", "South Park", "South Park", "South Park",]
subIndex = [ "Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]
mixIndex = list(zip(mainIndex, subIndex))
mixIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [159]:
## Multy Index function
mixIndex = pd.MultiIndex.from_tuples(mixIndex)
mixIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )